Revit 2020 API
ConnectorType Enumeration
 An enumerated type listing all connector types for a connection
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 20.0.0.0 (20.0.0.377)
Syntax
C#
public enum ConnectorType
Visual Basic
Public Enumeration ConnectorType
Visual C++
public enum class ConnectorType
Members
Member name | Description
Invalid |  Invalid connection type
End |  End connection type
Curve |  Curve connection type
Logical |  Logical connection type
Reference |  Reference connection type
Surface |  Surface connection type
EndSurface |  End or Surface connection type
Physical |  Physical connection type
NonEnd |  Not end connection type
MasterSurface |  Master surface connection type
Family |  Family connection type
NodeReference |  Reference to the layout node type
BlankEnd |  Blank End type
AnyEnd |  Any end connection type
Super |  Connection between a sub-system and a super-system, such as a connection between supply and return sub-systems and a main hydronic piping system or an air system.
AllModes |  All connection modes
See Also
Autodesk.Revit.DB Namespace